spec/vcr/Certification/Exempt_sales_should_be_reflected_in_the_test_data_through_use_of_ExemptionNo_or_CustomerUsageType_/does_not_add_additional_tax.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R809831262","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #6 - 8368","TaxCode":"PC030000","ItemCode":"SKU-6","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R809831262","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '812'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:35:59 GMT
      Content-Length:
      - '556'
      Set-Cookie:
      - TS017f1821=01a8ddc44e9546a498a36d427251253d9a83a9cfdb1d70ffb8ce67d4466ccf03957671096f49d48804f765d54e3945a419f0bec128;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvTrYeXhwb3fv072P
        RvzF06zlL/Z2dh9s7xxs7/AXb4pF3rTZYhV+9Wbv3qN7nz7a2RnvHjx8sPfp
        pz/Fjas2K48X1XrZovnujv3wadFMzcfu09N3+WLVFtUy/PhN9i6blIyMB4I+
        xSc7433/o5OsnK5LQn3mf5m9GxhN9u55scwb+uZ7CdEDf7yo6K+Pdrefn2kL
        Q6GXJzv3dujRj7NJURbtNb5p63WOT5/QkGZZff08v8xLfHE8m9V50+A7fsMf
        xCvFaGe8s09Q+TNqJB8x2n0iETKx8UXoRiPO26wo7dDok/ft/1V+oTCPn+Pv
        EyBT84i/eo0PvrOui+bN9YrhvG4B0Hz6Ilvwp8fPj58cf3FsPzfE3NnFR9Sf
        a5i+fnP85jR9c/x7f/RLku8n+L80USq6adIP6M+PHu7eT1+n38mmb5tqmb5u
        AVW/Nl09JYbFxyc6W19Uy/aiWuQ0EnzaHdTLivi7NC/f+3R3J0oMwks+OuOZ
        2Nu5v/fg4UN80xnn7s7u/V3Q95cko/fG/cu6uMDHP/e482S8ypt12ZrvX6+n
        U8L1o1+S/D/w9D5DSwQAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:00 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R809831262","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #6 - 8368","TaxCode":"PC030000","ItemCode":"SKU-6","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R809831262","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1159'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:00 GMT
      Content-Length:
      - '670'
      Set-Cookie:
      - TS017f1821=01a8ddc44eea8811febb83b206f1775ec186438f126b3b6bce57782844b208e8e8b8d2bfd7074e246ca8f0ba70de88a10108c6d849;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z2D7Z09fPGmWORNmy1W4Vdv9u49uvfpo52d8cHDg/s7
        9/Z/ihtXbVYeL6r1skXz3fv2w6dFMzUf79hPT9/li1VbVMvw4zfZu2xSMjIe
        CPoUn+yMP/U/OsnK6bok1Gf+l9m7+GhomGbwrw52Hh7c2937lL+gN54Xy7yh
        b76XEKHwx4uK/vpod/v5mbYwr7482bm3Q49+nE2Ksmiv8U1br3N8+oTGOsvq
        6+f5ZV7ii+PZrFZS9wfdJw6AKgH4g1c6mp3xzj51zJ9RI/loX//qksJ8/jRv
        s6K0QztBVzWj+9VrNHmVXyg2x8/x93fWddG8uV5xj69bAmg/NRTY2cVHBPt9
        0WQoL7IFNzt+fvzk+ItjfE6t3Kfp6zfHb07TN8e/90e/JPl+8kuSEaHtz8iz
        V/qOwefZK+qNHv34Z3VGmCM3jtRwVHdCzOc/jAm5JZYMxFH+lvPx/USaKA2d
        2OgH9OdHD3fvp6/T72TTt021TF+3gKpfG6SfkmbBxyc6V19Uy/aiWuREC3za
        JcvLihRRaV6+9+nuDrNUl1qEl3x0xmTf27m/9+DhQ3zDgzXv7+zu7uze3wVV
        hMEUOXy3++nOTvoyXy6b6/IyWxZZenyZpy++CyDazIBhKpoBfDdr5sXyoiV0
        8OnmARBi1Dd9LNjio6cn+LszgIf7feQJd30IeczI/wNzzZ673AUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:01 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R199622950","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"3366 Speedway Blvd","Line2":"","City":"Lincoln","Region":"Alabama","Country":"US","PostalCode":"35096"}],"Lines":[{"LineNo":"2-LI","Description":"Product
        #7 - 9753","TaxCode":"PC030000","ItemCode":"SKU-7","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":"","Discounted":false,"TaxIncluded":false}],"CustomerCode":"acreilly3@gmail.com","CompanyCode":"54321","CustomerUsageType":"","ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R199622950","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '827'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:01 GMT
      Content-Length:
      - '620'
      Set-Cookie:
      - TS017f1821=01a8ddc44ed327b80b7785419b16299230c3ae9321b4e809f3dba9ee8c8020bb86a6754d7cdc0735896e7689ade5fb683753351a69;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z2D7Z09fPGmWORNmy1W4Vdv9u49uvfpo53d8acP7+/v
        3/8pblu1WXm8qNbLFq13d+yHT4tmaj52n56+yxertqiW4cdvsnfZpGRcPBD0
        KT7ZGe/7H51k5XRdEuYz/8vsXXwwNEoz9le7Dx9+urf38L70kL17Xizzhr75
        XkJ0wh8vKvrro73t52fawrz68mTn3g49+nE2KcqivcY3bb3O8ekTGussq6+f
        55d5iS9+qljdxxf9EfcpA4j+6F/pUHbGO/vUK39GjeQjM95BOuRtVpR2XCfo
        qmZcv3qNJq/yC8Xm+Dn+/s66Lpo31yvu8XVLAO2nZvg7u/iIYL8vmgzlRbbg
        ZsfPj58cf3GMz6mV+zR9/eb4zWn65vj3/uiXJN9P8H9pcjyb1cSsbo70A/rz
        o3v3Pv00fb3K89lVdp0+KS9ngKsNDN5PiY/x8YlOFs3xtCqX/FGXLC8r4vnS
        vHnv/s7DT/Fxl1qElnx0xmTf293bJ6bCNzxW8/7O7u7e7v693b0dGtMoRP3h
        7v30dfqdbPq2qZbpa8ZQvzavf1kXF/jYIP5FtWwvqkVOCOPTG3D/dHeHqS+I
        4qM47jv39x48fIhvurjv7N7fxYRiLn5J8v8AmKEOw0YEAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:01 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R199622950","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"3366 Speedway Blvd","Line2":"","City":"Lincoln","Region":"Alabama","Country":"US","PostalCode":"35096"},{"AddressCode":"3","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"2-LI","Description":"Product
        #7 - 9753","TaxCode":"PC030000","ItemCode":"SKU-7","Qty":1,"Amount":10.0,"OriginCode":"3","DestinationCode":"Dest","CustomerUsageType":"","Discounted":false,"TaxIncluded":false}],"CustomerCode":"acreilly3@gmail.com","CompanyCode":"54321","CustomerUsageType":"","ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R199622950","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '948'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:01 GMT
      Content-Length:
      - '627'
      Set-Cookie:
      - TS017f1821=01a8ddc44e328f3cedec0ef8d1ab95e8c8a94579aad40c56dea4bbdec421ffd859a3f3fd52d6ffb260f1d5e8e76a6cfc7309198d8f;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2n348NO9vYf3d/SLp1nLX+zt7D7Y3jnY3tnDF2+KRd602WIVfvVm
        796je58+2tkb7x58uv/p/v2f4sZVm5XHi2q9bNF8l0Hzh0+LZmo+dp+evssX
        q7aoluHHb7J32aRkZDwQ9Ck+2Rnv+x+dZOV0XRLqM//L7N3zYpk39NH3EqIH
        /nhR0V8f7W0/P9MWhhAvT3bu7dCjH2eToizaa3zT1uscnz4hzGdZff08v8xL
        fPFTxeo+vujj3x8nIPpjeUW44q+d8c4+9cqfUSP5yGA/NKqneZsVpR3XCbqq
        GdevXqPJq/xCsTl+jr+/s66L5s31int83RJA+6kZ/s4uPiLY74smQ3mRLbjZ
        8fPjJ8dfHONzauU+TV+/OX5zmr45/r0/+iXJ9xP8X5ocz2Y1MaWbI/2A/vzo
        3r1PP01fr/J8dpVdp0/KyxngagOD91NiS3x8opNFczytyiV/1CXLy4pYuDRv
        3ru/8/BTfNylFqElH50x2fd29/ZJRPANj9W8v7O7u7e7f293b4fGNApR3/10
        Zyd9mS+XzXV5mS2LLD2+zNMX3wUQbWbA3MNnBvvvZs28WF60hA4+3TyAvZ37
        MiGCLT56eoK/OwN4uP8QnwbI7+7SZPJDyJvJiIj+L0n+H2RUmGlIBAAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:02 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R809831262","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #6 - 8368","TaxCode":"PC030000","ItemCode":"SKU-6","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":"A","Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":"A","Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":"A","ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R809831262","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1158'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:02 GMT
      Content-Length:
      - '683'
      Set-Cookie:
      - TS017f1821=01a8ddc44e250f5a479879e1124631fa006c7de294dd0541f85ae4603296a2459e8bee0995da3b4f5f15802e9b15eb9d81b25ec325;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvTrYeXhwb3fv072P
        RvzF06zlL/Z2dh9s7xxs7/AXb4pF3rTZYhV+9Wbv3qN7nz7a2Rs/ePCA21Vt
        Vh4vqvWyRcvd+/bDp0UzNR/v2E9P3+WLVVtUS3zstX6TvcsmJSPiGtOHvQ9O
        snK6LgnnmfsqezcwiOzd82KZN/TN9xIiA/54UdFfH+1uPz/TFoYwL0927u3Q
        ox9nk6Is2mt809brHJ8+oeHMsvr6eX6Zl/jieDar86bBd/yGh/8rRWhnvLNP
        QPkzasMf4fc+dQiT/tBCcvFH1PBp3mZFaYdFn7xX36/yC4V4/Bx/nwCRmof6
        1Wt88J11XTRvrlcM5XULcObTF9mCPz1+fvzk+Itj+7mh4s4uPqLeXMP09Zvj
        N6fpm+Pf+6Nfknw/+SXJiHD2p+LZK33HAHn2irCmRz9+z6kIaMYcFiP2e1GM
        fo9MDn3amYkeJbukZlrFKWsGbyn4XhgyCEdzOznUxn3am4nvJ9JEqeckRT+g
        Pz96uHs/fZ1+J5u+bapl+roFVP3aoPyUVAU+PtFZ+qJathfVIidK4NMuUV5W
        pFlK8/K9T3d39vFxl1aEl3x0xiTf27m/9+DhQ3zDgzXv7+zu7uze3wVNhLUU
        OXy3++nOTvoyXy6b6/IyWxZZenyZpy++CyDazIBhhWEG8N2smRfLi5bQwaeb
        B0CIUd/0sWCLj56e4O/OAB7u95En3PUh5Hk2XuXNumzN96/X0ykh+dEvSf4f
        Z41uf8YFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:02 GMT
recorded_with: VCR 3.0.3
