spec/vcr/Certification/return_orders/_commit_avatax_final/should_commit_avatax_final.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R247221839","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #8 - 6535","TaxCode":"PC030000","ItemCode":"SKU-8","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R247221839","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '812'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:03 GMT
      Content-Length:
      - '559'
      Set-Cookie:
      - TS017f1821=01a8ddc44e3ba91c51b46dd16be12bde8ead32333ea2c365424cddf5cf342d03a5354216e465c4de00055d6d880d26eb790edc6425;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2tt/sLe3e3DvoX7xNGv5i72d3QfbOwfbO3v44k2xyJs2W6zCr97s
        3Xt079NHO/fG+3v3P9092P8pbly1WXm8qNbLFs13d+yHT4tmaj52n56+yxer
        tqiW4cdvsnfZpGRkPBD0KT7ZGe/7H51k5XRdEuoz/8vs3fNimTf00fcSogf+
        eFHRXx/tbj8/0xaGEC9Pdu7t0KMfZ5OiLNprfNPW6xyfPiHMZ1l9/Ty/zEt8
        cTyb1UrR/hD6QwVQfzivCF38tTPe2aeO+TNqJB+ZAQwN7GneZkVph3aCrmpG
        96vXaPIqv1Bsjp/j7++s66J5c73iHl+3BNB+aiiws4uPCPb7oslQXmQLbnb8
        /PjJ8RfH+JxauU/T12+O35ymb45/749+SfL9BP+XJkpFN036Af350cPd++nr
        9DvZ9G1TLdPXLaDq1wbrp8SX+PhEZ+uLatleVIuciIFPu3R5WREbl+ble5/u
        7vAQuuQivOSjM6b73s79vQcPWUR4sOb9nd3dnd37u6DKL0lG7437l3VxgY9/
        7nE3kxGR/l+S/D8BvoSlSwQAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:03 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R247221839","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #8 - 6535","TaxCode":"PC030000","ItemCode":"SKU-8","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R247221839","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1159'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:04 GMT
      Content-Length:
      - '671'
      Set-Cookie:
      - TS017f1821=01a8ddc44e3434062f6081f2af721a0c9c9f7cdcd600baa29ac96dc08a493a3862256ed810085ae1d24951e125b0f64b75624efbfe;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2tt/sLe3e3DvoX7xNGv5i72d3QfbOwfbO3v44k2xyJs2W6zCr97s
        3Xt079NHO/vj3d1P9w52f4rbVm1WHi+q9bJF69379sOnRTM1H+/YT0/f5YtV
        W1TL8OM32btsUjIuHgj6FJ/sjD/1PzrJyum6JMxn/pfZu+fFMm/oo+8lRA78
        8aKivz7a3X5+pi0MHV6e7NzboUc/ziZFWbTX+Kat1zk+fUKYz7L6+nl+mZf4
        4ng2q5Wg/SH0hwqgOhz+4BWhi792xjv71DF/Ro3ko339qzsw8/nTvM2K0g7t
        BF3VjO5Xr9HkVX6h2Bw/x9/fWddF8+Z6xT2+bgmg/dRQYGcXHxHs90WTobzI
        Ftzs+Pnxk+MvjvE5tXKfpq/fHL85Td8c/94f/ZLk+8kvSUaEtj8jz17pOwaf
        Z6+oN3r045/VGWH+2jhSkQLCrjMh5vMfxoTcEksG4ih/y/n4fiJNlIZObPQD
        +vOjh7v309fpd7Lp26Zapq9bQNWvDdJPSU3g4xOdqy+qZXtRLXKiBT7tkuVl
        RVqlNC/f+3R3h1mqSy3CSz46Y7Lv7dzfe/CQNRYP1ry/s7u7s3t/F1QRBlPk
        8N3upzs76ct8uWyuy8tsWWTp8WWevvgugGgzA4apaAbw3ayZF8uLltDBp5sH
        QIhR3/SxYIuPnp7g784AHu73kSfc9SHkzWxEtPEvSf4fPGWzHNsFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:04 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R974003877","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"2-LI","Description":"Product
        #9 - 6067","TaxCode":"PC030000","ItemCode":"SKU-9","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":2,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R974003877","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '812'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:04 GMT
      Content-Length:
      - '554'
      Set-Cookie:
      - TS017f1821=01a8ddc44eef7a1c318a3e9496b1ce77c4a49df1366ab1fcb9e091c43a0708fc73fa7d526a3803cc7ea4c00e7aef394ff990c0da58;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvXr4YH9n597Bgwcf
        jfiLp1nLX+zt7D7Y3jnY3tnDF2+KRd602WIVfvVm796je58+2tkfH9x/cG9/
        76e4bdVm5fGiWi9btN7dsR8+LZqp+dh9evouX6zaolqGH7/J3mWTknHxQNCn
        +GRnvO9/dJKV03VJmM/8L7N3A4PJ3j0vlnlD33wvIXLgjxcV/fXR3vbzM21h
        CPTyZOfeDj36cTYpyqK9xjdtvc7x6RMa0iyrr5/nl3mJL45nszpvGnzHb/iD
        eKUY7Yx3iO4WrHzEaPeJRMjExhehG404b7OitEOjT963/1f5hcI8fo6/T4BM
        zSP+6jU++M66Lpo31yuG87oFQPPpi2zBnx4/P35y/MWx/dwQc2cXH1F/rmH6
        +s3xm9P0zfHv/dEvSb6f4P/SRKnopkk/oD8/erh7P32dfiebvm2qZfq6BVT9
        2nT1lPgVH5/obH1RLduLapHTSPBpd1AvK2Lv0rx879PdnSgxCC/56IxnYm/n
        /t6Dhw/xTWecuzu793dB31+SjN4b9y/r4gIf/9zjzpPxKm/WZWu+f72eTgnX
        j35J8v8ALm4n1EoEAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:05 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R974003877","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"4","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"2-LI","Description":"Product
        #9 - 6067","TaxCode":"PC030000","ItemCode":"SKU-9","Qty":1,"Amount":10.0,"OriginCode":"4","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":2,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R974003877","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '933'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:05 GMT
      Content-Length:
      - '615'
      Set-Cookie:
      - TS017f1821=01a8ddc44e2a77702fb8f7081fed7d85e78d5c1a58ae2c053b3588b9ea8c416ba7d0fc8a0724f22100d7146f2553b6bdf3ff2af574;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++evhgf2fn3sGDB/rF06zlL/Z2dh9s7xxs7+zhizfFIm/abLEKv3qz
        d+/RvU8f7dwf399/eH/v05/itlWblceLar1s0Xp3x374tGim5mP36em7fLFq
        i2oZfvwme5dNSsbFA0Gf4pOd8b7/0UlWTtclYT7zv8zePS+WeUMffS8hcuCP
        FxX99dHe9vMzbWHo8PJk594OPfpxNinKor3GN229zvHpE8J8ltXXz/PLvMQX
        x7NZrQTtD6E/VAD1h/OK0MVfO+MdmgHbs3xkBjA0sKd5mxWlHdoJuqoZ3a9e
        o8mr/EKxOX6Ov7+zrovmzfWKe3zdEkD7qaHAzi4+ItjviyZDeZEtuNnx8+Mn
        x18c43Nq5T5NX785fnOavjn+vT/6Jcn3E/xfmigV3TTpB/TnRw9376ev0+9k
        07dNtUxft4CqXxusnxJb4uMTna0vqmV7US1yIgY+7dLlZUVcXJqX7326u8ND
        6JKL8JKPzpjuezv39x48fIhveLDm/Z3d3Z3d+7ugyi9JRiHuu5/u7KQv8+Wy
        uS4vs2WRpceXefriuwCizQwYRsEM4LtZMy+WFy2hg083D4AQo77pY8EWHz09
        wd+dATzc7yNPuOtDyJvZiEj/L0n+HxM8ZpVLBAAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:05 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R282643595","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"3-LI","Description":"Product
        #10 - 2149","TaxCode":"PC030000","ItemCode":"SKU-10","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":3,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R282643595","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:06 GMT
      Content-Length:
      - '559'
      Set-Cookie:
      - TS017f1821=01a8ddc44eafb7baed4bc8aacc790cd11887d482fcd84aabda005885dbf395ae2a4d5472b7d8861af9833c33ed4d3ed3c0c5095d12;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z2D7Z09fPGmWORNmy1W4Vdv9u49uvfpo51Px/v37j04
        eLj/U9y4arPyeFGtly2a7+7YD58WzdR87D49fZcvVm1RLcOP32TvsknJyHgg
        6FN8sjPe9z86ycrpuiTUZ/6X2bv4aGiYZvCv9g72Pt2/d//hfXxBbzwvlnlD
        33wvIULhjxcV/fXRve3nZ9rCvPryZOfeDj36cTYpyqK9xjdtvc7x6RMa6yyr
        r5/nl3mJL45ns1pJ3R90nzgA6hPglY5mZ7yzTx3zZ9RIPjJDHiRF3mZFaYd2
        gq5qRver12jyKr9QbI6f4+/vrOuieXO94h5ftwTQfmoosLOLjwj2+6LJUF5k
        C252/Pz4yfEXx/icWrlP09dvjt+cpm+Of++Pfkny/QT/lyZKRTdN+gH9+dHD
        3fvp6/Q72fRtUy3T1y2g6tcG66fEyfj4RGfri2rZXlSLnIiBT7t0eVkR45fm
        5Xuf7u7wELrkIrzkozOm+97O/b0HDx/iGx6seX9nd3dn9/4uqPJLktF74/5l
        XVzg45973DEh/w8ZtiCfSwQAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:06 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R282643595","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"5","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"3-LI","Description":"Product
        #10 - 2149","TaxCode":"PC030000","ItemCode":"SKU-10","Qty":1,"Amount":10.0,"OriginCode":"5","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":3,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R282643595","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '935'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:06 GMT
      Content-Length:
      - '616'
      Set-Cookie:
      - TS017f1821=01a8ddc44eff375f919bba8f25c9d27ee20d4a35b1a33674fc3a0951e3972997f56cfc809ae270543102113d04b1e9826f9a81448b;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvdo72Pt0/979h/c/
        GvEXT7OWv9jb2X2wvXOwvbOHL94Ui7xps8Uq/OrN3r1H9z59tPNgvPPw/s6D
        h/d+ihtXbVYeL6r1skXz3R374dOimZqP3aen7/LFqi2qZfjxm+xdNikZGQ8E
        fYpPdsb7/kcnWTldl4T6zP8yezcwmuzd82KZN/TN9xKiB/54UdFfH93bfn6m
        LQyFXp7s3NuhRz/OJkVZtNf4pq3XOT59QkOaZfX18/wyL/HF8WxW502D7/gN
        fxCvFKOd8c4+QeXPqJF8xGj3iUTIxMYXoRuNOG+zorRDo0/et/9X+YXCPH6O
        v0+ATM0j/uo1PvjOui6aN9crhvO6BUDz6YtswZ8ePz9+cvzFsf3cEHNnFx9R
        f65h+vrN8ZvT9M3x7/3RL0m+n+D/0kSp6KZJP6A/P3q4ez99nX4nm75tqmX6
        ugVU/dp09ZQYFh+f6Gx9US3bi2qR00jwaXdQLyvi79K8fO/T3Z0oMQgv+eiM
        Z2Jv5/7eg4cP8U1nnLs7u/d3Qd9fkoxC3Hc/3dlJX+bLZXNdXmbLIkuPL/P0
        xXcBRJsZMCyUZgDfzZp5sbxoCR18unkAhBj1TR8Ltvjo6Qn+7gzg4X4fecJd
        H0KeZ+NV3qzL1nz/ej2dEpIf/ZLk/wEFLk0dTAQAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:07 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R974003877","DocDate":"2017-07-31","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"4","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"2-LI","Description":"Product
        #9 - 6067","TaxCode":"PC030000","ItemCode":"SKU-9","Qty":1,"Amount":10.0,"OriginCode":"4","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":2,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R974003877","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '934'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:07 GMT
      Content-Length:
      - '607'
      Set-Cookie:
      - TS017f1821=01a8ddc44ec9aefb1a249832b4538c39adb82e6a6a61e5c18416e6ea0e81b1b4b1387f33f59a7995fbb2b21a311e2fe4ddb597ce0e;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvXr4YH9n597Bgwcf
        jfiLp1nLX+zt7D7Y3nmwfW8XX7wpFnnTZouV++pge2fvzd69R/c+fbRzMKaP
        uF3VZuXxolovW7Tc3bEfPi2aqfnYfXr6Ll+s2qJahh+/yd5lk5Lx8EDQp/hk
        Z7zvf3SSldN1SVjP/C+zdwMDyd49L5Z5Q998LyFS4I8XFf310d728zNtYYjz
        8mTn3g49+nE2KcqivcY3bb3O8ekTGtIsq6+f55d5iS+OZ7M6bxp8x2/4g3il
        GO2Md4jmFqx8xGj3iUTIxMYXoRuNOG+zorRDo0/et/9X+YXCPH6Ov0+ATM0j
        /uo1PvjOui6aN9crhvO6BUDz6YtswZ8ePz9+cvzFsf3cEHPH0N81TF+/OX5z
        mr45/r0/+iXJ9xP8X5ooFd006Qf050cPd++nr9PvZNO3TbVMX7eAql+brp4S
        r+LjE52tL6ple1EtchoJPu0O6mVFrF2al+99ursTJQbhJR+d8Uzs7dzfe/Dw
        Ib7pjHN3Z/f+Luj7S5JRiPvupzs76ct8uWyuy8tsWWTp8WWevvgugGgzA4ZR
        MAP4btbMi+VFS+jg080DIMSob/pYsMVHT0/wd2cAD/f7yBPu+hDyPBuv8mZd
        tub71+vplJD86Jck/w9mqOE6RwQAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:08 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R974003877.","DocDate":"2017-08-02","Commit":true,"DocType":"ReturnInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"4","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"2-LI","Description":"Product
        #9 - 6067","TaxCode":"PC030000","ItemCode":"SKU-9","Qty":1,"Amount":-10.0,"OriginCode":"4","DestinationCode":"Dest","CustomerUsageType":null}],"CustomerCode":2,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R974003877","DetailLevel":"Tax","CurrencyCode":"USD","TaxOverride":{"TaxOverrideType":"TaxDate","Reason":"Refund
        for return #1","TaxDate":"2017-07-31"}}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '980'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:08 GMT
      Content-Length:
      - '617'
      Set-Cookie:
      - TS017f1821=01a8ddc44ec11bfeb4cd7e3f10345da8dbb55d40921dcf40853f3f5314ec2f09c8283d297a8c6f666b47384e70887f543a0c442790;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++evhgf2fn3sGDB2P95mnW8jd7O7sPtncOtnf28MWbYpE3bbZYhV+9
        2bv36N6nj3YOxvsPuFnVZuXxolovWzTc3t2xnz4tmqn53H16+i5frNqiWoYf
        v8neZZOS8fBh0Mf80c543//sJCun65LwngXfZu+eF8u8oc++lxA58MeLiv76
        aG/7+Zm2MHR4ebJzb4ce/TibFGXRXuObtl7n+PQJIT/L6uvn+WVe4ovj2axW
        gvZH0R8tgAYjekUI48+d8Q5Nge0aH3lDGBzb07zNitKO7gS91YzxV6/R5FV+
        oQgdP8ff31nXRfPmesV9vm4Jov3UEGFnFx8R7PfHlOG8yBbc7vj58ZPjL47x
        OTVzn6av3xy/OU3fHP/eH/2S5PsJ/i9NlJRurvQD+vOjh7v309fpd7Lp26Za
        pq9bQNWvDd5PiTXx8YlO2RfVsr2oFjmRA592KfOyIk4uzcv3Pt3d4SF0CUZ4
        yUdnTPq9nft7Dx4+xDc8WPP+zu7uzu79XZDllySjEPfdT3d20pf5ctlcl5fZ
        ssjS48s8ffFdANFmBgyjYAbw3ayZF8uLltDBp5sHQIhR3/SxYIuPnp7g784A
        Hu73kSfc9SHkzWyEGuDB9r3dj35J8v8AltkDn1AEAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:08 GMT
recorded_with: VCR 3.0.3
