spec/vcr/order_capture.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R961679607","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #26 - 8751","TaxCode":"PC030000","ItemCode":"SKU-26","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R961679607","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:38 GMT
      Content-Length:
      - '561'
      Set-Cookie:
      - TS017f1821=01a8ddc44eb7721bc4c1a07556114b11528a0fbb11f9dd330282d5206def1f9e573e1dd9193ff9b30161c18e54296d3a3d58b289bd;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++evjp7qcPHn6680C/eJq1/MXezu6D7Z2D7Z09fPGmWORNmy1W4Vdv
        9u49uvfpo3sH4/0Hnz482Lv3U9y4arPyeFGtly2a7+7YD58WzdR87D49fZcv
        Vm1RLcOP32TvsknJyHgg6FN8sjPe9z86ycrpuiTUZ/6X2bvnxTJv6KPvJUQP
        /PGior8+2t1+fqYtDCFenuzc26FHP84mRVm01/imrdc5Pn1CmM+y+vp5fpmX
        +OJ4NquVov0h9IcKoP5wXhG6+GtnvLNPHfNn1Eg+MgMYGtjTvM2K0g7tBF3V
        jO5Xr9HkVX6h2Bw/x9/fWddF8+Z6xT2+bgmg/dRQYGcXHxHs90WTobzIFtzs
        +Pnxk+MvjvE5tXKfpq/fHL85Td8c/94f/ZLk+wn+L02Uim6a9AP686OHu/fT
        1+l3sunbplqmr1tA1a8N1k+JL/Hxic7WF9WyvagWOREDn3bp8rIiNi7Ny/c+
        3d3hIXTJRXjJR2dM972d+3sPHj7ENzxY8/7O7u7O7v1dUOWXJKP3xv3LurjA
        xz/3uJvJiEj/L0n+H4sUjHBLBAAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:38 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R961679607","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #26 - 8751","TaxCode":"PC030000","ItemCode":"SKU-26","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R961679607","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:38 GMT
      Content-Length:
      - '695'
      Set-Cookie:
      - TS017f1821=01a8ddc44e5a6e89542a8052d2f7bd2dd8eb012bf68e2801572158eaba66db70ceab2700c4d785bb4a43443e73a071b5eb29f2a205;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvXr46e6nDx5+uvPg
        oxF/8TRr+Yu9nd0H2zsH2zt7+OJNscibNluswq/e7N17dO/TR/cejnce3N97
        uHP/p7hx1Wbl8aJaL1s0371vP3xaNFPz8Y799PRdvli1RbUMP36TvcsmJSPj
        gaBP8cnO+FP/o5OsnK5LQn3mf5m9GxhN9u55scwb+uZ7CdEDf7yo6K+Pdref
        n2kLQ6GXJzv3dujRj7NJURbtNb5p63WOT5/QkGZZff08v8xLfHE8m9V50+A7
        fkMHwSBeKUY74519gsqfUSP5aB9/9YlEyHTGxw0jdKMR521WlHZo9Mn79v8q
        v1CYx8/x9wmQqXnEX73GB99Z10Xz5nrFcF63AGg+fZEt+NPj58dPjr84tp8b
        Yu7s4iPqzzVMX785fnOavjn+vT/6Jcn3k1+SjAhtf0aevdJ3DJBnrwhvevTj
        95yRPtViBDdEY8bbSDPDUd0pMp93JqRHzS65mV5x6hoCWCq+J5YMxFHeThG1
        cp/25uP7iTRRGjqx0Q/oz48e7t5PX6ffyaZvm2qZvm4BVb82SD8lBYKPT3Su
        vqiW7UW1yIkW+LRLlpcV6ZvSvHzv092dKHMSXvLRGZN9b+f+3oOHD/END9a8
        v7O7u7N7fxdUEQZT5PDd7qc7O+nLfLlsrsvLbFlk6fFlnr74LoBoMwOGqWgG
        8N2smRfLi5bQwaebB0CIUd/0sWCLj56e4O/OAB7u95En3PUh5Hk2XuXNumzN
        96/X0ykh+dEvSf4fRRTF69wFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:39 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R961679607","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #26 - 8751","TaxCode":"PC030000","ItemCode":"SKU-26","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R961679607","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:39 GMT
      Content-Length:
      - '673'
      Set-Cookie:
      - TS017f1821=01a8ddc44ed60c99be2fd4030bd1affd33bcebb0bb45e6cdbc9c8eafacad782231fe3e2cd98ea5661ea23b69845b7fe6e91311e49f;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z2D7Z09fPGmWORNmy1W4Vdv9u49uvfpo3sPxwf7O/cP
        Hu7/FDeu2qw8XlTrZYvmu/fth0+LZmo+3rGfnr7LF6u2qJbhx2+yd9mkZGQ8
        EPQpPtkZf+p/dJKV03VJqM/8L7N38dHQMM3gXz38dPfTBw8/3XmAL+iN58Uy
        b+ib7yVEKPzxoqK/Ptrdfn6mLcyrL0927u3Qox9nk6Is2mt809brHJ8+obHO
        svr6eX6Zl/jieDarldT9QfeJA6BKAP7glY5mZ7yzTx3zZ9RIPtrXv7qkMJ8/
        zdusKO3QTtBVzeh+9RpNXuUXis3xc/z9nXVdNG+uV9zj65YA2k8NBXZ28RHB
        fl80GcqLbMHNjp8fPzn+4hifUyv3afr6zfGb0/TN8e/90S9Jvp/8kmREaPsz
        8uyVvmPwefaKeqNHP/5ZnRHmyI0jZVajv7oTYj7/YUzILbFkII7yt5yP7yfS
        RGnoxEY/oD8/erh7P32dfiebvm2qZfq6BVT92iD9lDQLPj7RufqiWrYX1SIn
        WuDTLlleVqSISvPyvU93d5ilutQivOSjMyb73s79vQcPH+IbHqx5f2d3d2f3
        /i6oIgymyOG73U93dtKX+XLZXJeX2bLI0uPLPH3xXQDRZgYMU9EM4LtZMy+W
        Fy2hg083D4AQo77pY8EWHz09wd+dATzc7yNPuOtDyGNG/h9gq74/3AUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:40 GMT
recorded_with: VCR 3.0.3
