spec/vcr/order_capture_with_customerusagetype.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R119605674","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #39 - 6870","TaxCode":"PC030000","ItemCode":"SKU-41","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R119605674","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:53 GMT
      Content-Length:
      - '557'
      Set-Cookie:
      - TS017f1821=01a8ddc44e0123918bbbb45a58bb78916bedb5cdb64e275ae10e72d1c10a417b94f765f42c185aa6a4da445705fa3c44feb4896148;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z2D7Z09fPGmWORNmy1W4Vdv9u49uvfpo/v3xp9+un9v
        /2D/p7hx1Wbl8aJaL1s0392xHz4tmqn52H16+i5frNqiWoYfv8neZZOSkfFA
        0Kf4ZGe87390kpXTdUmoz/wvs3fx0dAwzeBf7e4+/HTn/qcPzBvPi2Xe0Dff
        S4hQ+ONFRX99tLv9/ExbmFdfnuzc26FHP84mRVm01/imrdc5Pn1CY51l9fXz
        /DIv8cXxbFYrqfuD7hMHQH0CvNLR7Ix39qlj/owayUdmAIOkyNusKO3QTtBV
        zeh+9RpNXuUXis3xc/z9nXVdNG+uV9zj65YA2k8NBXZ28RHBfl80GcqLbMHN
        jp8fPzn+4hifUyv3afr6zfGb0/TN8e/90S9Jvp/g/9JEqeimST+gPz96uHs/
        fZ1+J5u+bapl+roFVP3aYP2UOBkfn+hsfVEt24tqkRMx8GmXLi8rYvzSvHzv
        090dHkKXXISXfHTGdN/bub/34OFDfMODNe/v7O7u7N7fBVV+STJ6b9y/rIsL
        fPxzjzsm5P8B3tC6iUsEAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:53 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R119605674","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #39 - 6870","TaxCode":"PC030000","ItemCode":"SKU-41","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R119605674","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:53 GMT
      Content-Length:
      - '695'
      Set-Cookie:
      - TS017f1821=01a8ddc44e679e606874c09faf7b5491ab3cde3d666d464dff616b1ff3d1727679df3e9ebdbaaf73ae4f5e58d4c4151f103f352350;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvdrdffjpzv1PH+x/
        NOIvnmYtf7G3s/tge+dge2cPX7wpFnnTZotV+NWbvXuP7n366P7++N69T/f2
        7n36U9y4arPyeFGtly2a7963Hz4tmqn5eMd+evouX6zaolqGH7/J3mWTkpHx
        QNCn+GRn/Kn/0UlWTtcloT7zv8zeDYwme/e8WOYNffO9hOiBP15U9NdHu9vP
        z7SFodDLk517O/Tox9mkKIv2Gt+09TrHp09oSLOsvn6eX+Ylvjiezeq8afAd
        v6GDYBCvFKOd8c4+QeXPqJF8JJPQIxIh0xkfN4zQjUact1lR2qHRJ+/b/6v8
        QmEeP8ffJ0Cm5hF/9RoffGddF82b6xXDed0CoPn0RbbgT4+fHz85/uLYfm6I
        ubOLj6g/1zB9/eb4zWn65vj3/uiXJN9PfkkyIrT9GXn2St8xQJ69Irzp0Y/f
        c0b6VIsR3BCNGW8jzQxHdafIfN6ZkB41u+RmesWpawhgqfieWDIQR3k7RdTK
        fdqbj+8n0kRp6MRGP6A/P3q4ez99nX4nm75tqmX6ugVU/dog/ZQUCD4+0bn6
        olq2F9UiJ1rg0y5ZXlakb0rz8r1Pd3eizEl4yUdnTPa9nft7Dx4+xDc8WPP+
        zu7uzu79XVBFGEyRw3e7n+7spC/z5bK5Li+zZZGlx5d5+uK7AKLNDBimohnA
        d7NmXiwvWkIHn24eACFGfdPHgi0+enqCvzsDeLjfR55w14eQ59l4lTfrsjXf
        v15Pp4TkR78k+X8APBcUrtwFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:54 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R119605674","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #39 - 6870","TaxCode":"PC030000","ItemCode":"SKU-41","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":"A","Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":"A","Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":"A","ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R119605674","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1160'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:54 GMT
      Content-Length:
      - '645'
      Set-Cookie:
      - TS017f1821=01a8ddc44ebc31c28f72faa4f934c2fab75efabaef37fcee42dd40924b249c20ec7722c2999166a200b9438ca4b88dcf84655fee04;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2t19+OnO/U8f7OsXT7OWv9jb2X2wvXOwvbOHL94Ui7xps8Uq/OrN
        3r1H9z59dP/+ePfeA25XtVl5vKjWyxYtd+/bD58WzdR8vGM/PX2XL1ZtUS3x
        sdf6TfYum5SMiGtMH/Y+OMnK6boknGfuq+zd82KZN/TB9xIiA/54UdFfH+1u
        Pz/TFmb8L0927u3Qox9nk6Is2mt809brHJ8+IaxnWX39PL/MS3xxPJvVSsgQ
        fQbSHyegekN5RcjyH+OdfeqYP6M2/JH+Hh/U07zNitIO6wS91IzqV6/R5FV+
        oZgcP8ff31nXRfPmesW9vW4JnP3UjH5nFx8R7PfCkEG8yBbc6Pj58ZPjL47x
        ObVxn6av3xy/OU3fHP/eH/2S5PvJL0lGhLM/Fc9e6TsGmWevqC969OMPmQpm
        pB/NhHzam4nvJ9JEqeckRT+gPz96uHs/fZ1+J5u+bapl+roFVP3aoPyUNAI+
        PtFZ+qJathfVIidK4NMuUV5WpEBK8/K9T3d3WOV0aUV4yUdnTPK9nft7Dx4+
        xDc8WPP+zu7uzu79XdBEWEuRw3e7n+7spC/z5bK5Li+zZZGlx5d5+uK7AKLN
        DBhWbmYA382aebG8aAkdfLp5AIQY9U0fC7b46OkJ/u4M4OF+H3nCXR9C3sxG
        RPH+kuT/AU6hgvzGBQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:55 GMT
recorded_with: VCR 3.0.3
