spec/vcr/order_capture_with_promo.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R363706306","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #29 - 8383","TaxCode":"PC030000","ItemCode":"SKU-29","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R363706306","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:42 GMT
      Content-Length:
      - '558'
      Set-Cookie:
      - TS017f1821=01a8ddc44e25e819a59efb821d8d6bc8990232b6ed8268db686f1a246b920040afe9994e1e077a8917e1b81dd698cbceedc9eda2b6;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++uvfpvQc7n97b+VS/eJq1/MXezu6D7Z2D7Z09fPGmWORNmy1W4Vdv
        9u49uvfpo/298c6nnz68/+n+T3Hjqs3K40W1XrZovrtjP3xaNFPzsfv09F2+
        WLVFtQw/fpO9yyYlI+OBoE/xyc543//oJCun65JQn/lfZu+eF8u8oY++lxA9
        8MeLiv76aHf7+Zm2MIR4ebJzb4ce/TibFGXRXuObtl7n+PQJYT7L6uvn+WVe
        4ovj2axWivaH0B8qgPrDeUXo4q+d8c4+dcyfUSP5yAxgaGBP8zYrSju0E3RV
        M7pfvUaTV/mFYnP8HH9/Z10XzZvrFff4uiWA9lNDgZ1dfESw3xdNhvIiW3Cz
        4+fHT46/OMbn1Mp9mr5+c/zmNH1z/Ht/9EuS7yf4vzRRKrpp0g8MWk+J8QDt
        RKfji2rZXlSLnEaLT7sDf1kRn5bm5Xuf7u4wjl16UMfy0RkTdm/n/t6Dhw/x
        DY/GvL+zu7uze39Xh62Y4YuHu/fT1+l3sunbplqmr1sa1KiP+5d1cYEX/1+P
        u5mMiPT/kuT/AUyR1xdLBAAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:42 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R363706306","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #29 - 8383","TaxCode":"PC030000","ItemCode":"SKU-29","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R363706306","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:42 GMT
      Content-Length:
      - '671'
      Set-Cookie:
      - TS017f1821=01a8ddc44e383295a6243a065bc3971fcdae946e3852b52608f58f4c0ef2761f9a86b09e27d78c3560cdd1577f172f33b5af5f58b9;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++uvfpvQc7n97b+VS/eJq1/MXezu6D7Z2D7Z09fPGmWORNmy1W4Vdv
        9u49uvfpo/298YPdew8e7B/8FDeu2qw8XlTrZYvmu/fth0+LZmo+3rGfnr7L
        F6u2qJbhx2+yd9mkZGQ8EPQpPtkZM8Lmo5OsnK5LQn3mf5m9e14s84Y++l5C
        9MAfLyr666Pd7edn2sIQ4uXJzr0devTjbFKURXuNb9p6nePTJ4T5LKuvn+eX
        eYkvjmezWinaH0J/qACqw+EPXhG6+GtnvLNPHfNn1Eg+2te/ugMznz/N26wo
        7dBO0FXN6H71Gk1e5ReKzfFz/P2ddV00b65X3OPrlgDaTw0FdnbxEcF+XzQZ
        yotswc2Onx8/Of7iGJ9TK/dp+vrN8ZvT9M3x7/3RL0m+n/ySZERo+zPy7JW+
        Y/B59op6o0c//lmdEeavjSMVMSDsOhNiPv9hTMgtsWQgjvK3nI/vJ9JEaejE
        Rj8wWD0lRQBoJzoZX1TL9qJa5DRYfNod98uK9EZpXr736e4O80yXHNSxfHTG
        dN3bub/34OFDfMOjMe/v7O7u7N7f1WErZvji4e799HX6nWz6tqmW6euWBgUG
        0xbmdSaPQfy7WTMvlhctoYFPNyNOCEmfgiU+enqCvzuIP9zvI00464OvFCX+
        4tOdnfRlvlw21+Vltiyy9PgyT198l5A3sxFRx78k+X8Aq37FM9wFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:42 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R363706306","DocDate":"2017-08-02","Discount":"10.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #29 - 8383","TaxCode":"PC030000","ItemCode":"SKU-29","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":true,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R363706306","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:42 GMT
      Content-Length:
      - '672'
      Set-Cookie:
      - TS017f1821=01a8ddc44ed108807f417592386c30b5855410262a76267dddfaafa2201cb8bfc7cd001e22dff6d0ecf5db2258e0257373cfebc74a;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++uvfpvQc7n97b+VS/eJq1/MXezu6D7Z2D7Z09fPGmWORNmy1W4Vdv
        9u49uvfpo/174/2D/QcP7u/9FDeu2qw8XlTrZYvmu/fth0+LZmo/3rEfn77L
        F6u2qJb43H38JnuXTUrGxoGgD/HBzljw0o9OsnK6Lgn1mf9l9u55scwb+uh7
        CdEDf7yo6K+Pdrefn2kLQ4iXJzv3dujRj7NJURbtNb5p63WOT58Q5rOsvn6e
        X+YlvjiezWqlaH8EkaECqgyH/35F6PIf45196pg/ozb8kf7eGZZ++jRvs6K0
        wzpBNzWj+tVrNHmVXygmx8/x93fWddG8uV5xb69bAmc/NaPf2cVHBPu9MGQQ
        L7IFNzp+fvzk+ItjfE5t3Kfp6zfHb07TN8e/90e/JPl+8kuSEeHsT8WzV/qO
        QebZK+qLHv34G50K/oCByjiZsTaN07JSZy7s5z+M2bgllgzEUf6W8/H9RJoo
        DZ286Af050cPd++nr9PvZNO3TbVMX7eAql8bpJ+SgsDHPQK8rEhzlKbZvU93
        d/bxcZcuhIF8dMYE3tu5v/fg4UN8w8My7+/s7u7s3t/V8Z8oY3xRLduLapFT
        v8Jgihy+2/10Zyd9mS+XzXV5mS2LLD2+zNMX38X72swAZyreMABCTPoWbPHR
        0xP83RnAw/0+8oS7PvjKIP/drJkXy4uWgLnZiOjhX5L8PyO5z77VBQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:43 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R363706306","DocDate":"2017-08-02","Discount":"10.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #29 - 8383","TaxCode":"PC030000","ItemCode":"SKU-29","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":true,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R363706306","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:43 GMT
      Content-Length:
      - '701'
      Set-Cookie:
      - TS017f1821=01a8ddc44e34b94c335c7200a75cacb84232e61e92af458c142e41c4673ad94961ad56c44f348ef1aec4e0ac2cdb54ac7fb22bdefc;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvbr36b0HO5/e2/n0
        oxF/8TRr+Yu9nd0H2zsH2zt7+OJNscibNluswq/e7N17dO/TR/v3xg/3dw4O
        9g9+ihtXbVYeL6r1skXz3fv2w6dFM7Uf79iPT9/li1VbVEt87j5+k73LJiVj
        40DQh/hgZyx46UcnWTldl4T6zP8yezcwmuzd82KZN/TN9xKiB/54UdFfH+1u
        Pz/TFoZCL0927u3Qox9nk6Is2mt809brHJ8+oSHNsvr6eX6Zl/jieDar86bB
        d/yGjIEhvFKEdsY7+wSUP6M2/BF+j1CIUAlHh08jJKPR5m1WlHZY9Ml79f0q
        v1CAx8/x9wkQqXmoX73GB99Z10Xz5nrFUF63AGc+fZEt+NPj58dPjr84tp8b
        Ku7s4iPqzTVMX785fnOavjn+vT/6Jcn3k1+SjAhnfyqevdJ3DJBnrwhrevTj
        95yKPsl8YvMHDFQoxhy3iWKWxzqzYz/vzEaPml1yM73i1DUEsFR8TywZiKO8
        nSJq5T7tzcf3E2miNHTyoh/Qnx893L2fvk6/k03fNtUyfd0Cqn5tkH5KmgMf
        n+hcfVEt24tqkRMt8GmXLC8rUjSlefnep7s7+/i4Sy3CSz46Y7Lv7dzfe/Dw
        Ib7hwZr3d3Z3d3bv74IqwmCKHL7b/XRnJ32ZL5fNdXmZLYssPb7M0xffBRBt
        ZsAwFc0Avps182J50RI6+HTzAAgx6ps+Fmzx0dMT/N0ZwMP9PvKEuz6EPM/G
        q7xZl635/vV6OiUkP/olyf8DE+EakdUFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:44 GMT
recorded_with: VCR 3.0.3
