spec/vcr/tax_included_order.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R973355868","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #30 - 5184","TaxCode":"PC030000","ItemCode":"SKU-30","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R973355868","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '813'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:44 GMT
      Content-Length:
      - '564'
      Set-Cookie:
      - TS017f1821=01a8ddc44eb2575f9002d4da1908f0992b874bf4bb65fb34b1c9e5f739bcd1e9cc28b5bf40c91e0cbf99d8c99e4d3e3b4109139d57;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvXr44N69+/cPPj34
        aMRfPM1a/mJvZ/fB9s7B9s4evnhTLPKmzRar8Ks3e/ce3fv00f7++ODg4f17
        Dw5+ihtXbVYeL6r1skXzh+NPBQY+flo0U/PFjv309F2+WLVFtQw/fpO9yyYl
        oxMAoc/x2c74HmNtPjvJyum6JPxnwbfZu4ExZe+eF8u8oW++lxBV8MeLiv76
        aHf7+Zm2MHR6ebJzb4ce/TibFGXRXuObtl7n+PQJDWuW1dfP88u8xBfHs1md
        Nw2+4zfCgbxSnHbGO/sE1wCWjwTzPq0In+gYI/SjUedtVpR2ePTJ18DhVX6h
        YI+f4+8TIFTzwL96jQ++s66L5s31igG9bgHRfPoiW/Cnx8+Pnxx/cWw/NzTd
        2cVH1KFrmL5+c/zmNH1z/Ht/9EuS7yf4vzRRYrrZ0g/oz48e7t5PX6ffyaZv
        m2qZvm4BVb82XT0l7sXHJzppX1TL9qJa5DQSfNod1MuKmL00L9/7dHdnHx93
        iUF4yUdnPBt7O/f3Hjx8iG8649zd2b2/CwL/kmT03rh/WRcX+PjnHneejFd5
        sy5b8/3r9XRKuH70S5L/Byk+XWhYBAAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:45 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R973355868","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #30 - 5184","TaxCode":"PC030000","ItemCode":"SKU-30","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R973355868","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1159'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:45 GMT
      Content-Length:
      - '682'
      Set-Cookie:
      - TS017f1821=01a8ddc44e7fa49032523ce8d60d8f10f2f73335f2b2daee527f15f34ad0d941804cb4fe4aa84388a7a762b31a5efd0f6295eb6e50;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++evjg3r379w8+PdAvnmYtf7G3s/tge+dge2cPX7wpFnnTZotV+NWb
        vXuP7n36aP/++P793fu7D3d/ihtXbVYeL6r1skXz3f3x/j37+dOimZpvduyn
        p+/yxaotqmX48ZvsXTYpGZ8QCn2BD3fG9x/4n51k5XRd0ghmwbfZu+fFMm/o
        s+8lRBf88aKivz7a3X5+pi0MQV6e7NzboUc/ziZFWbTX+Kat1zk+fULoz7L6
        +nl+mZf44ng2q5Wy/XH0xwugMqaH40+Zuq8IY/y9M97Zp65NM/noHs8M/dkd
        nP3iad5mRWmHd4Luakb5q9do8iq/UIyOn+Pv76zronlzveI+X7cE0X5qqLCz
        i48I9tdAlQG9yBbc7vj58ZPjL47xOTVzn6av3xy/OU3fHP/eH/2S5PvJL0lG
        hLk/Mc9e6TsGpWevqDt69OOf1YnZHx8wATaOdveh/tmdGPvFD2Ni3gNVBuSm
        4JYT8/1EmigxnRjpB/TnRw9376ev0+9k07dNtUxft4CqXxvEn5L+wMcnOmlf
        VMv2olrkRA982iXNy4rUTWlevvfp7s4+Pu5SjPCSj86Y9ns79/cePHSDNe/v
        7O7ukH4CWYTTFDl8t/vpzk76Ml8um+vyMlsWWXp8macvvgsg2syAYQkwA/hu
        1syL5UVL6ODTzQMgxKhv+liwxUdPT/B3ZwAP9/vIE+76EPJmNiJq+pck/w/L
        XxZH9AUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:45 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R973355868","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #30 - 5184","TaxCode":"PC030000","ItemCode":"SKU-30","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R973355868","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1159'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:45 GMT
      Content-Length:
      - '706'
      Set-Cookie:
      - TS017f1821=01a8ddc44ed9e6f8dda11c0359db982f8953b9b9d70b0a465308075fb027b3677704823cada20b41b79d5bec8f976e82ad4513a9c8;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvXr44N69+/cPPj34
        aMRfPM1a/mJvZ/fB9s7B9s4evnhTLPKmzRar8Ks3e/ce3fv00f6n43t79+4/
        ONj/KW5ctVl5vKjWyxbNd/fH+/fs50+LZmq+2bGfnr7LF6u2qJbhx2+yd9mk
        ZHxCKPQFPtwZ33/gf3aSldN1SSOYBd9m7wZGlb17Xizzhr75XkJ0wR8vKvrr
        o93t52fawlDq5cnOvR169ONsUpRFe41v2nqd49MnNK5ZVl8/zy/zEl8cz2Z1
        3jT4jt+QkTwcf8q9v1KcdsY7+wTXAJaP7sl89IhF+HTGKC0jBKRR521WlHZ4
        9MnXwOFVfqFgj5/j7xMgVPPAv3qND76zrovmzfWKAb1uAdF8+iJb8KfHz4+f
        HH9xbD83NN3ZxUfUoWuYvn5z/OY0fXP8e3/0S5LvJ78kGRHm/sQ8e6XvGCDP
        XhHi9OjH7zkxfcLFiG7otj8+YJQ30m33of7ZnSr7RWdieiTt0pyJFiexoYIl
        5ddAlQG5KbBzRc3cp72J+X4iTZSYToz0A/rzo4e799PX6Xey6dumWqavW0DV
        rw3iT0mx4OMTnbQvqmV7US1yogc+7ZLmZUV6qDQv3/t0d2cfH3cpRnjJR2dM
        +72d+3sPHrrBmvd3dnd3du/vgizCaYocvtv9dGcnfZkvl811eZktiyw9vszT
        F98FEG1mwLAsmQF8N2vmxfKiJXTw6eYBEGLUN30s2OKjpyf4uzOAh/t95Al3
        fQh5no1XebMuW/P96/V0Skh+9EuS/wewGsFi9AUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:46 GMT
recorded_with: VCR 3.0.3
